tap "homebrew/bundle"
tap "sst/tap"
brew "bat"
brew "curl"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "htop"
brew "jq"
brew "micro"
brew "ncdu"
brew "neovim"
brew "ripgrep"
brew "terraform"
brew "tree"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh"
brew "sst/tap/opencode"
cask "appcleaner"
cask "balenaetcher"
cask "brave-browser"
cask "bruno"
cask "cursor"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "slack"
cask "the-unarchiver"
cask "visual-studio-code"
cask "wezterm"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "arrterian.nix-env-selector"
vscode "beardedbear.beardedtheme"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradymholt.pgformatter"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "doppler.doppler-vscode"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "franneck94.c-cpp-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "humao.rest-client"
vscode "jnoortheen.nix-ide"
vscode "mansoorkhan96.php-cs-fixer"
vscode "mermade.openapi-lint"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "neilbrayfield.php-docblocker"
vscode "patricklee.vsnotes"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-icon-theme"
vscode "premparihar.gotestexplorer"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sburg.vscode-javascript-booster"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "vadimcn.vscode-lldb"
vscode "valeryanm.vscode-phpsab"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
