# Brewfile - Mac package definitions
# This file locks your package versions for reproducible Mac setups
#
# Usage:
#   Install all packages:     brew bundle --file=Brewfile
#   Update this file:         brew bundle dump --file=Brewfile --force
#   Cleanup unused packages:  brew bundle cleanup --file=Brewfile --force

# Taps (package repositories)
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Version Control
brew "git"

# Shell & Terminal
brew "zsh"

# Modern Unix Tools
brew "ripgrep"    # Better grep
brew "fd"         # Better find
brew "bat"        # Better cat
brew "fzf"        # Fuzzy finder
brew "eza"        # Better ls
brew "zoxide"     # Better cd

# Utilities
brew "wget"
brew "curl"
brew "jq"         # JSON processor
brew "yq"         # YAML processor
brew "tree"
brew "htop"
brew "ncdu"       # Disk usage analyzer

# Editors
brew "neovim"

# Development
cask "visual-studio-code"
cask "wezterm"
cask "docker"
cask "cursor"

# Browsers
cask "google-chrome"
cask "brave-browser"

# Communication
cask "slack"

# Productivity
cask "rectangle"
cask "obsidian"
cask "raycast"

# Utilities
cask "appcleaner"
cask "the-unarchiver"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
